late String name;

void learnFinalConst() {
  /* 
const (Compile-time constant — константа часу компіляції)
Коли обчислюється: Значення const має бути відоме до запуску програми — ще в момент компіляції (коли ви натискаєте «зберегти» або «зібрати» код).

Жорсткі обмеження: Ви не можете присвоїти в const результат виконання якоїсь функції, якщо вона не є константними обчисленнями, або поточний час (DateTime.now()), бо компілятор не знає, котра година буде, коли користувач відкриє додаток.

Пам'ять: Об'єкти, оголошені через const, зберігаються в спеціальній пам'яті один раз (створюється єдиний екземпляр на весь застосунок, що економить ресурси).
*/
  const int a = 10;

  // a = 20; // error

  /* 
final (Run-time constant — константа часу виконання)
Коли обчислюється: Значення final визначається під час виконання програми (коли користувач уже взаємодіє з додатком). Але важливо: після того, як значення туди записано вперше, змінити його вже неможливо.

Гнучкість: Сюди можна запихати результати функцій, динамічні дані, поточний час (DateTime.now()) чи дані, які завантажуються з інтернету.

Призначення: Використовується для значень, які не змінюватимуться протягом життєвого циклу цього об'єкта чи екрана, але стають відомими лише в момент запуску.
*/
  final int b = 10;
  // b = 10; // The final variable 'b' can only be set once.
  final c;
  c = 15; // ok
  // c = 20; // error
  final list = <String>['text1, text2, text3'];
  list.add('text4'); // можемо працювати з даним списком, чітко фіксуємо що в цій змінній саме список
  print(list); // [text1, text2, text3, text4]

  /* Можемо опускати явне вказування типу для const та final(краще вказувати) */
  const age = 25;
  final constNumber = 4101010;

  /* Не можна додавати елементи способом методу add */
  var first = const <int>[];
  final second = const <int>[];
  const third = <int>[];

  first = const [1, 2, 4]; // можемо змінювати списком
  // first = const  10; // error, бо тип не список
  // second = const [1,2,3]; // error
  // third = const [1,4,5]; // error
  // first[0] = 30; // Unsupported operation: Cannot modify an unmodifiable list
  print(first);

  /* 
  Модифікатор late
  У мові Dart модифікатор late — це зовсім про інше. Якщо final та const відповідають за незмінність (щоб значення не можна було перезаписати), то late відповідає за момент ініціалізації (створення значення).

  Дослівно late перекладається як «пізньо» або «пізній». Він каже компілятору: «Спокійно, я створю цю змінну не одразу, а трохи пізніше (перед першим використанням), тому не вимагай задавати її значення при оголошенні».
  */
  // print(name); // LateInitializationError: Field 'name' has not been initialized.

  name = "Jhon";
  print(name);
}

void main(List<String> arguments) {
  learnFinalConst();
}
